clases/2021-01-26-unicidad-realización-geométrica.tex
% Created 2021-02-01 Mon 21:24
% Intended LaTeX compiler: pdflatex
\documentclass[spanish, presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lxfonts}
\usepackage[spanish, mexico, es-noshorthands, english]{babel}
% remove space between margin and lists
\usepackage{enumitem}
\setitemize{label=\usebeamerfont*{itemize item}%
\usebeamercolor[fg]{itemize item}
\usebeamertemplate{itemize item}}
\setlist{leftmargin=*,labelindent=0cm}
\setenumerate[1]{%
label=\protect\usebeamerfont{enumerate item}%
\protect\usebeamercolor[fg]{enumerate item}%
\insertenumlabel.}
\usepackage{listings}
\lstset{
literate={í}{{\'\i}}1
{á}{{\'a}}1
{é}{{\'e}}1
{ó}{{\'o}}1
{ú}{{\'u}}1
}
\lstalias{ipython}{python}
\usepackage{tikz}
\usepackage{tkz-berge}
\usetikzlibrary{graphs}
\usetikzlibrary{graphs.standard}
\usetheme[noframetitlerule]{Verona}
\author{Rafael Villarroel}
\date{2021-01-26 15:00 -0500}
\title{Unicidad de la realización geométrica}
\beamerdefaultoverlayspecification{<+->}
\hypersetup{
 pdfauthor={Rafael Villarroel},
 pdftitle={Unicidad de la realización geométrica},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\languagepath{spanish}

\section{Unicidad de la realización geométrica}
\label{sec:orgdbcb520}

\begin{frame}[label={sec:org121f0b2}]{Homeomorfismo}
Dos espacios métricos \(X,Y\) son \alert{homeomorfos}  si existen funciones \(f\colon X\to Y\), \(g\colon Y\to X\) continuas, tales que \(g\circ f=1_{X}\) y \(f\circ g=1_{Y}\). Esto se denota como \(X\cong Y\).
\end{frame}

\begin{frame}[label=1.2]{Lema}
Sea \(A\subseteq \mathbb{R}^{n}\) un conjunto afínmente independiente. Para \(v\in A\), definimos la función \(t_{v}\colon |A|\to \mathbb{R}\), donde \(t_{v}(\alpha)\) es la coordenada baricéntrica correspondiente a \(v\) de \(\alpha\) (es decir, \(\alpha=t_{v}(\alpha)v+\sum_{w\in A-\{v\}} t_{w}w\) y \(\sum_{w\in A}t_{w}=1\)). Entonces \(t_{v}\) es continua.
\end{frame}

\begin{frame}[label={sec:org8c346c3}]{Lema del pegado}
Sean \(X, Y\) dos espacios topológicos, y sean \(F_{1},F_{2}\subseteq X\) conjuntos cerrados tales que \(X=F_{1}\cup F_{2}\). Sean \(f_{1}\colon F_{1}\to Y\) y \(f_{2}\colon F_{2}\to Y\) funciones continuas. Supongamos que \(f_{1}(x)=f_{2}(x)\) si \(x\in F_{1}\cap F_{2}\). Entonces la función \(f\colon X\to Y\) definida como:
\begin{equation}
\label{eq:1}
f(x)=
\begin{cases}
f_{1}(x) & \text{si \(x\in F_{1}\)},\\
f_{2}(x) & \text{si \(x\in F_{2}\)}
\end{cases}
\end{equation}
es continua.
\end{frame}

\begin{frame}[label={sec:org4adee54}]{Observación}
El lema del pegado puede extenderse por inducción al caso en el que \(X\) es igual a la unión de una cantidad finita de conjuntos cerrados.
\end{frame}

\begin{frame}[label={sec:orgb57b3ee}]{Observación}
Sea \(\Delta\) un complejo simplicial, y sea \(\phi\colon\Delta_{0}\to \mathbb{R}^{n}\) un encaje afín. Supongamos \(\alpha\in|\sigma|_{\phi}\cap|\tau|_{\phi}\). Para cada \(v\in \phi(\sigma)\) existe una función \(t_{v}^{\sigma}\) como en el lema \ref{1.2}. Si además \(v\in\phi(\tau)\), entonces existe una función \(t_{v}^{\tau}\). Como \(\phi\) es un encaje afín, existe \(\rho\in\Delta\) tal que \(|\rho|_{\phi}=|\sigma|_{\phi}\cap|\tau|_{\phi}\), 
\end{frame}

\begin{frame}[label={sec:org4e29dd7}]{Teorema}
Sea \(\Delta\) un complejo simplicial. Sean \(\phi\colon\Delta_{0}\to \mathbb{R}^{n}\) y \(\psi\colon\Delta_{0}\to \mathbb{R}^{m}\) dos encajes afines. Entonces \(|\Delta|_{\phi}\) es homeomorfo a \(|\Delta|_{\psi}\). 
\end{frame}

\begin{frame}[label={sec:org8a937c4}]{Demostración}
Sea \(\Delta_{0}=\{x_{0},x_{1},\ldots,x_{k}\}\). Sea \(\alpha\in |\Delta|_{\phi}\). Entonces \(\alpha\in |\sigma|_{\phi}\) para algún \(\sigma\in\Delta\). Supongamos que \(\sigma=\{x_{i_{0}},x_{i_{i}},\ldots,x_{i_{s}}\}\). Supongamos \(\alpha=\sum_{j=0}^{s} t_{i_{j}}\phi(x_{i_{j}})\). Definimos \(f(\alpha)\) como \(f(\alpha)=\sum_{j=0}^{s} t_{i_{j}}\psi(x_{i_{j}})\). Para demostrar que la función \(f\colon |\Delta|_{\phi}\to |\Delta|_{\psi}\subseteq\mathbb{R}^{m}\) es continua, basta con demostrar que para cada simplejo \(\sigma\in\Delta\) se tiene que la función que extrae las coordenadas baricéntricas de \(|\sigma|_{\phi}\) es continua.
\end{frame}
\end{document}